app/controllers/incomes_controller.rb

SELECT "incomes".* FROM "incomes" ORDER BY created_at DESC
---
  def index
    @incomes = Income.all

INSERT INTO "incomes" ("amount", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["amount", "10.0"], ["created_at", "2020-08-12 20:33:23.938188"], ["updated_at", "2020-08-12 20:33:23.938188"]]
---
  def create
    @income = Income.new(income_params)

    if @income.save