app/controllers/spends_controller.rb

SELECT "spends".* FROM "spends"
---
  def index
    @spends = Spend.all

INSERT INTO "spends" ("category", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "Grocery"], ["amount", "5.85"], ["created_at", "2020-08-12 20:32:54.084893"], ["updated_at", "2020-08-12 20:32:54.084893"]]
---
  def create
    @spend = Spend.new(spend_params)

    if @spend.save

DELETE FROM "spends" WHERE "spends"."id" = $1  [["id", 20]]
---
  def destroy
    @spend.destroy

SELECT "spends".* FROM "spends" WHERE "spends"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    def set_spend
      @spend = Spend.find(params[:id])